app/controllers/exams_controller.rb

  def index
    @exams = Exam.all
---
SELECT * FROM "exams"

  def show
    @exam = Exam.find(params[:id])
---
SELECT * FROM "exams" WHERE ("exams"."id" = 1)