app/controllers/users_controller.rb

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2009-07-09 16:35:33', "encrypted_password" = 'aa033b15464ba8b4b39d69e5a17cd0cd8b2701e5' WHERE "id" = 1