app/controllers/user_questions_controller.rb

  def update
    if @question.update_attributes :answers => params[:answers]
---
UPDATE "user_questions" SET "correct" = 'f', "updated_at" = '2009-07-06 15:36:25' WHERE "id" = 1

  def find_question
    @question = UserQuestion.find(params[:id])
---
SELECT * FROM "user_questions" WHERE ("user_questions".user_exam_id = 1)