app/controllers/user_exams_controller.rb

SELECT * FROM "exams" WHERE ("exams"."id" = 1)
SELECT * FROM "user_questions" WHERE ("user_questions".user_exam_id = 1)
---
  def create
      exam = Exam.find(params[:id])
      redirect_to :action => 'index' if exam.nil?
      user_exam = UserExam.start!(@current_user, exam)
      redirect_to :controller => :user_questions, :action => 'edit', :id => user_exam.user_questions.first.id if user_exam